In [1]:
import pandas as pd

In [ ]:
#adding new columns
data = {
    "Name":["Ram","Shyam","Ghanshym","Dhanshyam","Aditya","Jagdish","Raj","Simran"],
    "Age":[28,34,22,30,29,40,25,32],
    "Salary":[50000,60000,45000,52000,49000,70000,48000,58000],
    "Performance_Score":[85,98,78,92,88,95,80,89]
}

df = pd.DataFrame(data)

print(df)

df["Bonus"] = df["Salary"] * 0.1
print(df)

        Name  Age  Salary  Performance_Score
0        Ram   28   50000                 85
1      Shyam   34   60000                 98
2   Ghanshym   22   45000                 78
3  Dhanshyam   30   52000                 92
4     Aditya   29   49000                 88
5    Jagdish   40   70000                 95
6        Raj   25   48000                 80
7     Simran   32   58000                 89
        Name  Age  Salary  Performance_Score   Bonus
0        Ram   28   50000                 85  5000.0
1      Shyam   34   60000                 98  6000.0
2   Ghanshym   22   45000                 78  4500.0
3  Dhanshyam   30   52000                 92  5200.0
4     Aditya   29   49000                 88  4900.0
5    Jagdish   40   70000                 95  7000.0
6        Raj   25   48000                 80  4800.0
7     Simran   32   58000                 89  5800.0

In [4]:
#adding using insert method
#df.insert(location, "column name", some_data)

df.insert(0,"Employee ID",[10,20,30,40,50,60,70,80])
print(df)

   Employee ID       Name  Age  Salary  Performance_Score   Bonus
0           10        Ram   28   50000                 85  5000.0
1           20      Shyam   34   60000                 98  6000.0
2           30   Ghanshym   22   45000                 78  4500.0
3           40  Dhanshyam   30   52000                 92  5200.0
4           50     Aditya   29   49000                 88  4900.0
5           60    Jagdish   40   70000                 95  7000.0
6           70        Raj   25   48000                 80  4800.0
7           80     Simran   32   58000                 89  5800.0

In [ ]:
#updating data
#.loc[]
#df.loc[row_index, "column name"] = new_value

df.loc[0, 'Salary'] = 55000
print(df)

   Employee ID       Name  Age  Salary  Performance_Score   Bonus
0           10        Ram   28   55000                 85  5000.0
1           20      Shyam   34   60000                 98  6000.0
2           30   Ghanshym   22   45000                 78  4500.0
3           40  Dhanshyam   30   52000                 92  5200.0
4           50     Aditya   29   49000                 88  4900.0
5           60    Jagdish   40   70000                 95  7000.0
6           70        Raj   25   48000                 80  4800.0
7           80     Simran   32   58000                 89  5800.0

In [6]:
#increasing salary by 5%

df['Salary'] = df['Salary'] * 1.05
print(df)

   Employee ID       Name  Age   Salary  Performance_Score   Bonus
0           10        Ram   28  57750.0                 85  5000.0
1           20      Shyam   34  63000.0                 98  6000.0
2           30   Ghanshym   22  47250.0                 78  4500.0
3           40  Dhanshyam   30  54600.0                 92  5200.0
4           50     Aditya   29  51450.0                 88  4900.0
5           60    Jagdish   40  73500.0                 95  7000.0
6           70        Raj   25  50400.0                 80  4800.0
7           80     Simran   32  60900.0                 89  5800.0

In [11]:
#removing column
#df.drop(columns = ["columnName"], inplace=True) inplace = true it means it modify original data directly 
# and if inplace = false it means it retuns new dataframe

data = {
    "Name":["Ram","Shyam","Ghanshym","Dhanshyam","Aditya","Jagdish","Raj","Simran"],
    "Age":[28,34,22,30,29,40,25,32],
    "Salary":[50000,60000,45000,52000,49000,70000,48000,58000],
    "Performance_Score":[85,98,78,92,88,95,80,89]
}

df = pd.DataFrame(data)


print("\n\nmodified data")
df.drop(columns=["Performance_Score"], inplace=True) 
print(df)


#if you want to remove multiple data

print("\n\nmultiple column remove")
df.drop(columns=["Salary", "Age"], inplace=True) 
print(df)

modified data
        Name  Age  Salary
0        Ram   28   50000
1      Shyam   34   60000
2   Ghanshym   22   45000
3  Dhanshyam   30   52000
4     Aditya   29   49000
5    Jagdish   40   70000
6        Raj   25   48000
7     Simran   32   58000


multiple column remove
        Name
0        Ram
1      Shyam
2   Ghanshym
3  Dhanshyam
4     Aditya
5    Jagdish
6        Raj
7     Simran

In [ ]:
#handling missing data
NaN (Not a number)
None (for object data types)

isNull()
True - NaN is missing
False - value is present

In [17]:
#handling missing data
data = {
    "Name":["Ram",None,"Ghanshym","Dhanshyam","Aditya","Jagdish","Raj","Simran"],
    "Age":[28,None,22,30,29,40,25,32],
    "Salary":[50000,None,45000,52000,49000,70000,48000,58000],
    "Performance_Score":[85,None,78,92,88,95,80,89]
}

df = pd.DataFrame(data)
print(df)


print(df.isnull())
print(df.isnull().sum()) #return the total number none value in a column

        Name   Age   Salary  Performance_Score
0        Ram  28.0  50000.0               85.0
1       None   NaN      NaN                NaN
2   Ghanshym  22.0  45000.0               78.0
3  Dhanshyam  30.0  52000.0               92.0
4     Aditya  29.0  49000.0               88.0
5    Jagdish  40.0  70000.0               95.0
6        Raj  25.0  48000.0               80.0
7     Simran  32.0  58000.0               89.0
    Name    Age  Salary  Performance_Score
0  False  False   False              False
1   True   True    True               True
2  False  False   False              False
3  False  False   False              False
4  False  False   False              False
5  False  False   False              False
6  False  False   False              False
7  False  False   False              False
Name                 1
Age                  1
Salary               1
Performance_Score    1
dtype: int64

In [ ]:
#dropna() - remove missing value

data = {
    "Name":["Ram",None,"Ghanshym","Dhanshyam","Aditya","Jagdish","Raj","Simran"],
    "Age":[28,None,22,30,29,40,25,32],
    "Salary":[50000,None,45000,52000,49000,70000,48000,58000],
    "Performance_Score":[85,None,78,92,88,95,80,89]
}

df = pd.DataFrame(data)
print(df)

df.dropna(inplace=True)
print(df)

        Name   Age   Salary  Performance_Score
0        Ram  28.0  50000.0               85.0
1       None   NaN      NaN                NaN
2   Ghanshym  22.0  45000.0               78.0
3  Dhanshyam  30.0  52000.0               92.0
4     Aditya  29.0  49000.0               88.0
5    Jagdish  40.0  70000.0               95.0
6        Raj  25.0  48000.0               80.0
7     Simran  32.0  58000.0               89.0
        Name   Age   Salary  Performance_Score
0        Ram  28.0  50000.0               85.0
2   Ghanshym  22.0  45000.0               78.0
3  Dhanshyam  30.0  52000.0               92.0
4     Aditya  29.0  49000.0               88.0
5    Jagdish  40.0  70000.0               95.0
6        Raj  25.0  48000.0               80.0
7     Simran  32.0  58000.0               89.0

In [23]:
#fillna() - fill missing values

data = {
    "Name":["Ram",None,"Ghanshym","Dhanshyam","Aditya","Jagdish","Raj","Simran"],
    "Age":[28,None,22,30,29,40,25,32],
    "Salary":[50000,None,45000,52000,49000,70000,48000,58000],
    "Performance_Score":[85,None,78,92,88,95,80,89]
}

df = pd.DataFrame(data)
print(df)

# df.fillna(0, inplace=True)
df['Age'].fillna(df["Age"].mean(), inplace=True)
df['Salary'].fillna(df["Salary"].mean(), inplace=True)
df['Performance_Score'].fillna(df["Performance_Score"].mean(), inplace=True)
print(df)

        Name   Age   Salary  Performance_Score
0        Ram  28.0  50000.0               85.0
1       None   NaN      NaN                NaN
2   Ghanshym  22.0  45000.0               78.0
3  Dhanshyam  30.0  52000.0               92.0
4     Aditya  29.0  49000.0               88.0
5    Jagdish  40.0  70000.0               95.0
6        Raj  25.0  48000.0               80.0
7     Simran  32.0  58000.0               89.0
        Name        Age        Salary  Performance_Score
0        Ram  28.000000  50000.000000          85.000000
1       None  29.428571  53142.857143          86.714286
2   Ghanshym  22.000000  45000.000000          78.000000
3  Dhanshyam  30.000000  52000.000000          92.000000
4     Aditya  29.000000  49000.000000          88.000000
5    Jagdish  40.000000  70000.000000          95.000000
6        Raj  25.000000  48000.000000          80.000000
7     Simran  32.000000  58000.000000          89.000000

C:\Users\dell\AppData\Local\Temp\ipykernel_9196\1679714215.py:14: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df["Age"].mean(), inplace=True)
C:\Users\dell\AppData\Local\Temp\ipykernel_9196\1679714215.py:15: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(df["Salary"].mean(), inplace=True)
C:\Users\dell\AppData\Local\Temp\ipykernel_9196\1679714215.py:16: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Performance_Score'].fillna(df["Performance_Score"].mean(), inplace=True)

In [ ]:
#interpolation
# #interpolate() - use 
'''
interpolation main use - 
time series data
numeric data with trends
avoid dropping rows
'''

data = {
    "Name":["Ram","Shyam","Ghanshym","Dhanshyam","Aditya","Jagdish","Raj","Simran"],
    "Age":[28,None,22,30,29,40,25,32],
    "Salary":[50000,None,45000,52000,49000,70000,48000,58000],
    "Performance_Score":[85,None,78,92,88,95,80,89]
}

df = pd.DataFrame(data)
print(df)


#linear, polynomial, time

df.interpolate(method="linear", axis=0, inplace=True)
print(df)

        Name   Age   Salary  Performance_Score
0        Ram  28.0  50000.0               85.0
1      Shyam   NaN      NaN                NaN
2   Ghanshym  22.0  45000.0               78.0
3  Dhanshyam  30.0  52000.0               92.0
4     Aditya  29.0  49000.0               88.0
5    Jagdish  40.0  70000.0               95.0
6        Raj  25.0  48000.0               80.0
7     Simran  32.0  58000.0               89.0
        Name   Age   Salary  Performance_Score
0        Ram  28.0  50000.0               85.0
1      Shyam  25.0  47500.0               81.5
2   Ghanshym  22.0  45000.0               78.0
3  Dhanshyam  30.0  52000.0               92.0
4     Aditya  29.0  49000.0               88.0
5    Jagdish  40.0  70000.0               95.0
6        Raj  25.0  48000.0               80.0
7     Simran  32.0  58000.0               89.0

C:\Users\dell\AppData\Local\Temp\ipykernel_9196\269581400.py:17: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(method="linear", axis=0, inplace=True)

In [26]:
#linear dataframe

data1 = {
    "Time":[1,2,3,4,5],
    "value":[10,None,30,None,50]
}

df = pd.DataFrame(data1)
print("Before interpolation")
print(df)

print("\n\nAfter interpolation")

df["value"] = df["value"].interpolate(method="linear")
print(df)

Before interpolation
   Time  value
0     1   10.0
1     2    NaN
2     3   30.0
3     4    NaN
4     5   50.0


After interpolation
   Time  value
0     1   10.0
1     2   20.0
2     3   30.0
3     4   40.0
4     5   50.0

In [33]:
#sorting 
#sorting data 1 column sort_values()

data2 = {
    "Name": ["Arun","Varun","Karan"],
    "Age": [28,34,22],
    "Salary": [10000,20000,30000]
}

df = pd.DataFrame(data2)

df.sort_values(by="Age", ascending=True, inplace=True)
print(df)

    Name  Age  Salary
2  Karan   22   30000
0   Arun   28   10000
1  Varun   34   20000

In [34]:
#sorting data multiple columns

df.sort_values(by=["Age", "Salary"], ascending=[True, False], inplace=True)
print(df)

    Name  Age  Salary
2  Karan   22   30000
0   Arun   28   10000
1  Varun   34   20000

In [35]:
#aggregation
'''
df["columnName"].mean()
df["columnName"].sum()
df["columnName"].min()
df["columnName"].max()
'''

data2 = {
    "Name": ["Arun","Varun","Karan"],
    "Age": [28,34,22],
    "Salary": [10000,20000,30000]
}

df = pd.DataFrame(data2)

avg_salary = df["Salary"].mean()
print(avg_salary)

20000.0

In [ ]:
#grouping

data2 = {
    "Name": ["Arun","Varun","Karan","Narun","Marun"],
    "Age": [28,34,22,34,28],
    "Salary": [50000,60000,45000,52000,48000]
}

df = pd.DataFrame(data2)
grouped = df.groupby("Age")["Salary"].sum()
print(grouped)

'''
df.groupby("Age")
age = 22 > [45000] =
age = 28 [50000, 48000] =
age = 34 [60000, 52000]

[Salary].sum()
age = 22 > [45000] = 45000
age = 28 [50000, 48000] = 98000
age = 34 [60000, 52000] = 112000
'''

Age
22     45000
28     98000
34    112000
Name: Salary, dtype: int64

In [ ]:
#mulitple column grouped then apply aggregation


data2 = {
    "Name": ["Arun","Varun","Karan","Narun","Marun"],
    "Age": [28,34,22,34,28],
    "Salary": [50000,60000,45000,52000,48000]
}

df = pd.DataFrame(data2)
grouped = df.groupby(["Age","Name"])["Salary"].sum()
print(grouped)

Age  Name
22   Karan    45000
28   Arun     50000
     Marun    48000
34   Narun    52000
     Varun    60000
Name: Salary, dtype: int64

In [ ]:
sum() - add all values of a group
count() - non NaN count
mean() - average
min() - return minimum values
max() - return maximum values
std() - return stardard deviation

In [44]:
#merging 
#syntax = pd.merge(df1,df2, on="column name",how="type of join")

df_customers = pd.DataFrame({
    'CustomerId':[1,2,3],
    'Name':['Ramesh', 'Suresh','Kalpesh']
})

df_orders = pd.DataFrame({
    'CustomerId':[1,2,4],
    'OrderAmount':[250,450,350]
})

#merge
#inner join
df_merged = pd.merge(df_customers, df_orders, on="CustomerId", how="inner")
print("inner join")
print(df_merged)

#outer join
df_merged = pd.merge(df_customers, df_orders, on="CustomerId", how="outer")
print("\n\nouter join")
print(df_merged)


#left join
df_merged = pd.merge(df_customers, df_orders, on="CustomerId", how="left")
print("\n\nleft join")
print(df_merged)


#right join
df_merged = pd.merge(df_customers, df_orders, on="CustomerId", how="right")
print("\n\nright join")
print(df_merged)


'''
for cross join
1df = m rows
2df = n rows
m*n rows
'''

inner join
   CustomerId    Name  OrderAmount
0           1  Ramesh          250
1           2  Suresh          450


outer join
   CustomerId     Name  OrderAmount
0           1   Ramesh        250.0
1           2   Suresh        450.0
2           3  Kalpesh          NaN
3           4      NaN        350.0


left join
   CustomerId     Name  OrderAmount
0           1   Ramesh        250.0
1           2   Suresh        450.0
2           3  Kalpesh          NaN


right join
   CustomerId    Name  OrderAmount
0           1  Ramesh          250
1           2  Suresh          450
2           4     NaN          350

'\nfor cross join\n1df = m rows\n2df = n rows\nm*n rows\n'

In [47]:
#concatenate
'''vertically (row - wise)
horizontally ( column wise)
pd.concate([df1, df2, axis=0], ignore_index=True)
'''

df_region1 = pd.DataFrame({
    "Customer_id":[1,2],
    "Name":["Gopal","Raju"]
})
df_region2 = pd.DataFrame({
    "Customer_id":[3,4],
    "Name":["Shyam","Baburao"]
})

#concatenate vertically

df_concat = pd.concat([df_region1, df_region2], ignore_index=True)
print(df_concat)

#horizontally concatenate
df_concat = pd.concat([df_region1, df_region2], axis=1, ignore_index=True)
print("\n\n",df_concat)

   Customer_id     Name
0            1    Gopal
1            2     Raju
2            3    Shyam
3            4  Baburao


    0      1  2        3
0  1  Gopal  3    Shyam
1  2   Raju  4  Baburao